<template>
  <div class="checkChart">
      <div class='progress'>
        <el-divider content-position="left">进度展示</el-divider>
        <p>已完成/总量</p>
        <div class='progress-line'>
          <el-progress :text-inside="true" :stroke-width="26" :percentage="percentage" ></el-progress>
          <div class='progress-line-text'>{{text}}</div>
        </div>        
      </div>
      <div class="chart"> 
        <el-divider content-position="left">详情统计</el-divider>
        <div id="planChart" ref="planChart" @click="handleClick"></div>
      </div>
      
  </div>
</template>

<script>
export default {
  name: 'checkChart',
  data () {
    return {
      percentage:0,
      text:'',      
      planChart:null
    }
  },
  props:['chartData'],
  watch:{
    chartData:{
      handler(){
        if(this.chartData.statusMap){
          this.percentage=(this.chartData.statusMap.get('4').count*100/this.chartData.total).toFixed(2);
          this.text=this.chartData.statusMap.get('4').count+'/'+this.chartData.total;
        }
      },      
      deep:true
    }
  },
  methods: {
    handleClick(){
      
    },
    draw(){
      const th=this;
      this.planChart = this.$echarts.init(this.$refs.planChart);

      let target={
        
      };
      let barOption={
        title:{
          text:'图斑状态统计一览',          
          left:'center',
          subtext :'按图斑个数统计'
        },
        legend:{
          left:'left',
          top:'top',
          orient:'vertical',
        },
        tooltip:{
          formatter: "{b}<br/>个数：{c}<br/>"
        },
        toolbox:{
          showTitle:false,
          tooltip:{
            show: true,
            position:'left',          
          },
          feature:{
            myToolToPie: {
              show: true,
              title: '切换为饼图',
              icon: 'path://M453.042424 1014.690909c124.121212 0 238.933333-49.648485 319.612121-133.430303L453.042424 564.751515V114.812121C201.69697 114.812121 0 316.509091 0 564.751515s201.69697 449.939394 453.042424 449.939394z m62.060606-515.10303H992.969697C992.969697 235.830303 778.860606 21.721212 515.10303 21.721212v477.866667z m24.824243 62.060606l322.715151 316.509091c80.678788-80.678788 130.327273-192.387879 130.327273-316.509091H539.927273z',
              onclick: function (){
                th.planChart.clear();
                th.planChart.setOption(pieOption);
              }
            },
            myToolArea:{
              show: true,
              title: '按照面积统计',
              icon:'M819.2 819.2 122.88 819.2 122.88 204.8 368.64 204.8 368.64 122.88 40.96 122.88 40.96 901.12 901.12 901.12 901.12 655.36 819.2 655.36ZM294.912 450.56l0-40.96L241.664 409.6l0 315.392 49.152 0 0-135.168c0-40.96 4.096-69.632 12.288-86.016s20.48-28.672 32.768-40.96C352.256 454.656 368.64 450.56 385.024 450.56s28.672 4.096 40.96 12.288 16.384 20.48 20.48 32.768S450.56 532.48 450.56 565.248l0 159.744 49.152 0 0-122.88c0-40.96 4.096-69.632 8.192-86.016 4.096-20.48 16.384-32.768 32.768-45.056 16.384-12.288 32.768-16.384 49.152-16.384s32.768 4.096 40.96 12.288c12.288 8.192 16.384 20.48 20.48 32.768S655.36 532.48 655.36 561.152l0 172.032 53.248 0 0-172.032c0-57.344-12.288-98.304-32.768-118.784S630.784 409.6 602.112 409.6s-49.152 8.192-69.632 20.48-32.768 28.672-40.96 45.056c-4.096-16.384-16.384-28.672-32.768-40.96-20.48-12.288-40.96-20.48-65.536-20.48C348.16 401.408 315.392 417.792 294.912 450.56zM864.256 475.136l69.632-73.728c20.48-20.48 32.768-40.96 45.056-57.344 8.192-16.384 16.384-32.768 16.384-53.248 0-24.576-8.192-45.056-28.672-65.536S921.6 204.8 892.928 204.8s-49.152 8.192-69.632 28.672-28.672 45.056-32.768 77.824l36.864 0c0-24.576 8.192-40.96 20.48-53.248 12.288-12.288 24.576-16.384 40.96-16.384s32.768 4.096 45.056 16.384 16.384 24.576 16.384 40.96-4.096 28.672-12.288 40.96c-8.192 12.288-20.48 28.672-40.96 49.152L778.24 516.096l212.992 0 0-36.864-126.976 0L864.256 475.136z',
              onclick: function (){
                th.planChart.clear();
                th.planChart.setOption(barArea);
              }
            },
            saveAsImage:{
              pixelRatio:1
            },
          }
        },
        grid:{
          show:true,
          width:400,
          left :'160px',
          bottom:30
        },
        xAxis:  {
          show:true,
          type: 'category',
          axisLabel : {//坐标轴刻度标签的相关设置。
            interval:0,                      
          },
          data: ['图斑筛查','设计规划','施工整治','竣工验收']
        },
        yAxis: {
          show:true,
          type: 'value',
          minInterval: 1,
          axisLabel: {
              formatter: '{value} 个'
          }
        },
        series : [
          {
            name: '图斑筛查', 
            type: 'bar',
            stack:'1',
            data:[
              th.chartData.statusMap.get('1').count,
              0,0,0
            ]
          },{
            name: '设计规划', 
            type: 'bar',
            stack:'1',
            data:[
              0,
              th.chartData.statusMap.get('2').count,
              0,0
            ]
          },{
            name: '施工整治', 
            type: 'bar',
            stack:'1',
            data:[
              0,0,
              th.chartData.statusMap.get('3').count,
              0
            ]
          },{
            name: '竣工验收', 
            type: 'bar',
            stack:'1',
            data:[
              0,0,0,
              th.chartData.statusMap.get('4').count,
            ]
          }
        ]
      };
      let pieOption={
        title:{
          text:'图斑状态统计一览',          
          left:'center',
          subtext :'按图斑个数统计'
        },
        legend:{
          left:'left',
          top:'top',
          orient:'vertical',
        },
        tooltip:{
          formatter: "{b}<br/>个数：{c}<br/> 占比：{d}%"
        },
        toolbox:{
          showTitle:false,
          tooltip:{
            show: true,
            position:'left',          
          },
          feature:{
            myToolToBar: {
              show: true,
              title: '切换为柱状图',
              icon: 'path://M0 870.4h1024v65.828571H0v-65.828571z m138.971429-446.171429h138.971428v409.6H138.971429V424.228571z m204.8-336.457142h138.971428v753.371428H343.771429V87.771429z m204.8 475.428571h138.971428v270.628571H548.571429V563.2z m204.8-204.8h138.971428v475.428571h-138.971428V358.4z',
              onclick:function(){
                th.planChart.clear();
                th.planChart.setOption(barOption);
              }
            },
            myToolArea:{
              show: true,
              title: '按照面积统计',
              icon:'M819.2 819.2 122.88 819.2 122.88 204.8 368.64 204.8 368.64 122.88 40.96 122.88 40.96 901.12 901.12 901.12 901.12 655.36 819.2 655.36ZM294.912 450.56l0-40.96L241.664 409.6l0 315.392 49.152 0 0-135.168c0-40.96 4.096-69.632 12.288-86.016s20.48-28.672 32.768-40.96C352.256 454.656 368.64 450.56 385.024 450.56s28.672 4.096 40.96 12.288 16.384 20.48 20.48 32.768S450.56 532.48 450.56 565.248l0 159.744 49.152 0 0-122.88c0-40.96 4.096-69.632 8.192-86.016 4.096-20.48 16.384-32.768 32.768-45.056 16.384-12.288 32.768-16.384 49.152-16.384s32.768 4.096 40.96 12.288c12.288 8.192 16.384 20.48 20.48 32.768S655.36 532.48 655.36 561.152l0 172.032 53.248 0 0-172.032c0-57.344-12.288-98.304-32.768-118.784S630.784 409.6 602.112 409.6s-49.152 8.192-69.632 20.48-32.768 28.672-40.96 45.056c-4.096-16.384-16.384-28.672-32.768-40.96-20.48-12.288-40.96-20.48-65.536-20.48C348.16 401.408 315.392 417.792 294.912 450.56zM864.256 475.136l69.632-73.728c20.48-20.48 32.768-40.96 45.056-57.344 8.192-16.384 16.384-32.768 16.384-53.248 0-24.576-8.192-45.056-28.672-65.536S921.6 204.8 892.928 204.8s-49.152 8.192-69.632 28.672-28.672 45.056-32.768 77.824l36.864 0c0-24.576 8.192-40.96 20.48-53.248 12.288-12.288 24.576-16.384 40.96-16.384s32.768 4.096 45.056 16.384 16.384 24.576 16.384 40.96-4.096 28.672-12.288 40.96c-8.192 12.288-20.48 28.672-40.96 49.152L778.24 516.096l212.992 0 0-36.864-126.976 0L864.256 475.136z',
              onclick: function (){
                th.planChart.clear();
                th.planChart.setOption(pieArea);
              }
            },
            saveAsImage:{
              pixelRatio:1
            },
          }
        },
        series : [
          {
            name: '详情统计',
            type: 'pie',
            radius: '55%',
            roseType: 'area',            
            center: ['50%', '65%'],
            data:[
              {value:th.chartData.statusMap.get('1').count, name:'图斑筛查'},
              {value:th.chartData.statusMap.get('2').count, name:'设计规划'},
              {value:th.chartData.statusMap.get('3').count, name:'施工整治'},
              {value:th.chartData.statusMap.get('4').count, name:'竣工验收'},
            ]
          },
        ]
      };
      let pieArea={
        title:{
          text:'图斑状态统计一览',          
          left:'center',
          subtext :'按图斑面积统计'
        },
        legend:{
          left:'left',
          top:'top',
          orient:'vertical',
        },
        tooltip:{
          formatter: "{b}<br/>面积：{c}平方米<br/> 占比：{d}%"
        },
        toolbox:{
          showTitle:false,
          tooltip:{
            show: true,
            position:'left',          
          },
          feature:{
            myToolToBar: {
              show: true,
              title: '切换为柱状图',
              icon: 'path://M0 870.4h1024v65.828571H0v-65.828571z m138.971429-446.171429h138.971428v409.6H138.971429V424.228571z m204.8-336.457142h138.971428v753.371428H343.771429V87.771429z m204.8 475.428571h138.971428v270.628571H548.571429V563.2z m204.8-204.8h138.971428v475.428571h-138.971428V358.4z',
              onclick:function(){
                th.planChart.clear();
                th.planChart.setOption(barArea);
              }
            },
            myToolArea:{
              show: true,
              title: '按照数量统计',
              icon:'M193.728 784H129.152V360.128a334.4 334.4 0 0 1-61.184 45.824A428.416 428.416 0 0 1 0 440.32V376a389.12 389.12 0 0 0 94.72-63.552c27.008-24.896 46.144-49.024 57.408-72.448h41.6v544z m428.992-63.936v63.936H262.976c-0.512-16 2.112-31.36 7.808-46.208 9.152-24.32 23.808-48.384 43.968-72.064 20.16-23.68 49.28-51.008 87.424-82.048 59.136-48.256 99.136-86.528 119.936-114.752 20.8-28.16 31.168-54.848 31.168-80 0-26.368-9.472-48.64-28.416-66.688-18.944-18.112-43.584-27.2-74.048-27.2-32.192 0-57.92 9.6-77.184 28.8-19.328 19.264-29.12 45.888-29.376 79.872l-68.672-7.04c4.736-51.008 22.4-89.856 53.12-116.544 30.72-26.752 71.872-40.128 123.584-40.128 52.224 0 93.568 14.4 124.032 43.264 30.4 28.8 45.632 64.512 45.632 107.136 0 21.696-4.48 43.008-13.376 64-8.896 20.864-23.68 42.88-44.352 66.112-20.672 23.168-55.04 54.912-103.04 95.36-40.064 33.472-65.792 56.192-77.184 68.16a218.88 218.88 0 0 0-28.16 36.032h266.88z m41.472-86.016l67.456-8.768c7.744 37.12 20.928 63.744 39.552 80.128 18.624 16.32 41.28 24.512 68.032 24.512 31.744 0 58.56-10.688 80.384-32 21.888-21.312 32.832-47.68 32.832-79.168 0-30.016-10.176-54.784-30.4-74.24-20.224-19.52-45.952-29.248-77.184-29.248-12.8 0-28.608 2.432-47.616 7.296l7.488-57.408a142.144 142.144 0 0 0 88.448-21.12c23.04-14.464 34.496-36.864 34.496-67.136 0-23.936-8.32-43.84-25.088-59.52-16.768-15.744-38.4-23.68-64.832-23.68-26.24 0-48.128 8.064-65.6 24-17.472 16-28.8 39.936-33.728 71.936l-67.456-11.648c8.256-43.776 26.944-77.76 56.192-101.824 29.248-24.128 65.6-36.16 109.056-36.16 30.016 0 57.6 6.208 82.816 18.688 25.28 12.48 44.544 29.44 57.92 51.008a128 128 0 0 1 20.032 68.672c0 23.04-6.4 43.904-19.072 62.848-12.8 18.88-31.616 33.92-56.64 44.992 32.512 7.296 57.728 22.4 75.712 45.248S1024 582.912 1024 617.344c0 46.464-17.472 85.824-52.48 118.144-34.944 32.32-79.168 48.512-132.672 48.512-48.192 0-88.256-13.952-120.128-41.792-31.808-27.84-49.984-63.872-54.528-108.16z',
              onclick: function (){
                th.planChart.clear();
                th.planChart.setOption(pieOption);         
              }
            },
            saveAsImage:{
              pixelRatio:1
            },
          }
        },
        series : [
          {
            name: '详情统计',
            type: 'pie',
            radius: '55%',
            roseType: 'area',            
            center: ['50%', '65%'],
            data:[
              {value:th.chartData.statusMap.get('1').area, name:'图斑筛查'},
              {value:th.chartData.statusMap.get('2').area, name:'设计规划'},
              {value:th.chartData.statusMap.get('3').area, name:'施工整治'},
              {value:th.chartData.statusMap.get('4').area, name:'竣工验收'},
            ]
          },
        ]
      };
      let barArea={
        title:{
          text:'图斑状态统计一览',          
          left:'center',
          subtext :'按图斑面积统计'
        },
        legend:{
          left:'left',
          top:'top',
          orient:'vertical',
        },
        tooltip:{
          formatter: "{b}<br/>{c}平方米<br/>"
        },
        toolbox:{
          showTitle:false,
          tooltip:{
            show: true,
            position:'left',          
          },
          feature:{
            myToolToPie: {
              show: true,
              title: '切换为饼图',
              icon: 'path://M453.042424 1014.690909c124.121212 0 238.933333-49.648485 319.612121-133.430303L453.042424 564.751515V114.812121C201.69697 114.812121 0 316.509091 0 564.751515s201.69697 449.939394 453.042424 449.939394z m62.060606-515.10303H992.969697C992.969697 235.830303 778.860606 21.721212 515.10303 21.721212v477.866667z m24.824243 62.060606l322.715151 316.509091c80.678788-80.678788 130.327273-192.387879 130.327273-316.509091H539.927273z',
              onclick: function (){
                th.planChart.clear();
                th.planChart.setOption(pieArea);
              }
            },
            myToolArea:{
              show: true,
              title: '按照数量统计',
              icon:'M193.728 784H129.152V360.128a334.4 334.4 0 0 1-61.184 45.824A428.416 428.416 0 0 1 0 440.32V376a389.12 389.12 0 0 0 94.72-63.552c27.008-24.896 46.144-49.024 57.408-72.448h41.6v544z m428.992-63.936v63.936H262.976c-0.512-16 2.112-31.36 7.808-46.208 9.152-24.32 23.808-48.384 43.968-72.064 20.16-23.68 49.28-51.008 87.424-82.048 59.136-48.256 99.136-86.528 119.936-114.752 20.8-28.16 31.168-54.848 31.168-80 0-26.368-9.472-48.64-28.416-66.688-18.944-18.112-43.584-27.2-74.048-27.2-32.192 0-57.92 9.6-77.184 28.8-19.328 19.264-29.12 45.888-29.376 79.872l-68.672-7.04c4.736-51.008 22.4-89.856 53.12-116.544 30.72-26.752 71.872-40.128 123.584-40.128 52.224 0 93.568 14.4 124.032 43.264 30.4 28.8 45.632 64.512 45.632 107.136 0 21.696-4.48 43.008-13.376 64-8.896 20.864-23.68 42.88-44.352 66.112-20.672 23.168-55.04 54.912-103.04 95.36-40.064 33.472-65.792 56.192-77.184 68.16a218.88 218.88 0 0 0-28.16 36.032h266.88z m41.472-86.016l67.456-8.768c7.744 37.12 20.928 63.744 39.552 80.128 18.624 16.32 41.28 24.512 68.032 24.512 31.744 0 58.56-10.688 80.384-32 21.888-21.312 32.832-47.68 32.832-79.168 0-30.016-10.176-54.784-30.4-74.24-20.224-19.52-45.952-29.248-77.184-29.248-12.8 0-28.608 2.432-47.616 7.296l7.488-57.408a142.144 142.144 0 0 0 88.448-21.12c23.04-14.464 34.496-36.864 34.496-67.136 0-23.936-8.32-43.84-25.088-59.52-16.768-15.744-38.4-23.68-64.832-23.68-26.24 0-48.128 8.064-65.6 24-17.472 16-28.8 39.936-33.728 71.936l-67.456-11.648c8.256-43.776 26.944-77.76 56.192-101.824 29.248-24.128 65.6-36.16 109.056-36.16 30.016 0 57.6 6.208 82.816 18.688 25.28 12.48 44.544 29.44 57.92 51.008a128 128 0 0 1 20.032 68.672c0 23.04-6.4 43.904-19.072 62.848-12.8 18.88-31.616 33.92-56.64 44.992 32.512 7.296 57.728 22.4 75.712 45.248S1024 582.912 1024 617.344c0 46.464-17.472 85.824-52.48 118.144-34.944 32.32-79.168 48.512-132.672 48.512-48.192 0-88.256-13.952-120.128-41.792-31.808-27.84-49.984-63.872-54.528-108.16z',
              onclick: function (){
                th.planChart.clear();
                th.planChart.setOption(barOption);  
              }
            },
            saveAsImage:{
              pixelRatio:1
            },
          }
        },
        grid:{
          show:true,
          width:400,
          left :'160px',
          bottom:30
        },
        xAxis:  {
          show:true,
          type: 'category',
          axisLabel : {//坐标轴刻度标签的相关设置。
            interval:0,                      
          },
          data: ['图斑筛查','设计规划','施工整治','竣工验收']
        },
        yAxis: {
          show:true,
          type: 'value',
          minInterval: 1,
          axisLabel: {
              formatter: '{value} ㎡'
          }
        },
        series : [
          {
            name: '图斑筛查', 
            type: 'bar',
            stack:'1',
            data:[
              th.chartData.statusMap.get('1').area,
              0,0,0
            ]
          },{
            name: '设计规划', 
            type: 'bar',
            stack:'1',
            data:[
              0,
              th.chartData.statusMap.get('2').area,
              0,0
            ]
          },{
            name: '施工整治', 
            type: 'bar',
            stack:'1',
            data:[
              0,0,
              th.chartData.statusMap.get('3').area,
              0
            ]
          },{
            name: '竣工验收', 
            type: 'bar',
            stack:'1',
            data:[
              0,0,0,
              th.chartData.statusMap.get('4').area,
            ]
          }
        ]
      };
      // 使用刚指定的配置项和数据显示图表。
      this.planChart.setOption(pieOption);
      //刚进入标签页时宽度不正确，手动重置
      this.planChart.resize();
    },
    clearChart(){      
      this.planChart&&this.planChart.dispose();
      this.percentage=0;
      this.text='';
    }
  }
}
</script>

<style lang="scss" scoped>
.checkChart{
  .progress{        

    .el-divider--horizontal{
      margin:10px 0;
    }
    >p{
      padding:5px 0;
      text-align: center;
    }
    .progress-line{
      display: flex;
      justify-content: space-around;

      .progress-line-text{
        line-height: 26px;
      }
    }
    /deep/.el-progress--line{
      width:80%;
      // margin-left: 10px;
    }
  }
  
}
#planChart {
  width: 580px;
  height:210px;  
  border: 1px solid #CCC;
  margin:0 auto;
}

</style>